_src/wiki/2017-04-04-tomcat-split-log.org
# -*- coding: utf-8-unix; -*-
#+TITLE:       tomcat日志catalina.out按日期分割
#+AUTHOR:      Bruce Asu
#+EMAIL:       bruceasu@163.com
#+DATE:        <2017-04-04 20:00>
#+filetags:    tomcat
#+DESCRIPTION: Tomcat 通过使用 cronolog 来把日志文件 catalina.out 按日期分割。

#+LANGUAGE:    en
#+OPTIONS:     H:7 num:nil toc:t \n:nil ::t |:t ^:nil -:nil f:t *:t <:nil

* Linux下cronolog安装配置

Linux下运行的Web服务器Apache，默认日志文件是不分割的，一个整文件既不易于管理，也
不易于分析统计。安装cronolog后，可以将日志文件按时间分割，易于管理和分析。


cronolog安装配置非常简单，下载后只需要输入几个命令即可完成。

1. 下载（最新版本）


2. 解压缩
: tar zxvf cronolog-1.6.2.tar.gz

3. 进入cronolog安装文件所在目录
: cd cronolog-1.6.2

4. 运行安装
: ./configure
: make && make install

5. 查看cronolog安装后所在目录（验证安装是否成功）
: which cronolog

一般情况下显示为：/usr/local/sbin/cronolog

6. 要想分割tomcat的catalina.out，需作如下工作：
: vim /usr/local/apache-tomcat-8.0.39/bin/catalina.sh

* 修改 ${tomcat_home}/bin目录下的 catalina.sh 文件中的

替换下面的行
: org.apache.catalina.startup.Bootstrap "$@" start "$CATALINA_OUT" 2>&1 "&"

换成
: org.apache.catalina.startup.Bootstrap "$@" start 2>&1 | /usr/local/sbin/cronolog ${CATALINA_BASE}/logs/catalina.%Y-%m-%d.out >> /dev/null &
